aa-conformance-tests.org
:PROPERTIES:
:ID:       20220315T130057.751591
:END:
#+TITLE: DRP Authorized Agent Conformance Test Suite
#+ARCOLOGY_KEY: doc/drp/aa-conformance
#+filetags: :Work:ConsumerReports:Development:Writing:
#+TYP_TODO: NEXT INPROGRESS DONE CANCELLED

* Introduction

this document is highly speculative and has ~0 real work put in to it. The outline is in-progress thinking material. Please open a GH issue with any feedback or reach out directly to the DRP team through the Feedback from at [[http://datarightsprotocol.org/][datarightsprotocol.org]]

* What does an AA need to be tested for

- The AA can discover API endpoints using data-rights.json
- The AA supports submitting requests under which regimes? // Who determines permitted regimes?
  - Consumer is the authority on regime
  - AA is the delegated authority on regime
  - AA chooses the regimes they honor
  - CB must honor all regimes
- Does the AA submit well-formed requests for those rights?
- Is the AA's identity JWT signed with an attestable key?
- Does the AA support the =needs_user_verification= flow semantics?
- Does the AA support the asynchronous callback mechanism?
- Does the AA adhere to reasonable rate-limiting for =status= queries?

* How do you test an authorized agent?

- A data-rights.json that points to the PIP implementation
- A "reference" PIP implementation accepts requests from the AA
- This PIP implementation has a simple dashboard or API to move requests through the state transitions, query any "internal" state

* How does the Covered Business Accept/Interact with the AA? (governance/onboarding, etc of new AAs)

- Acknowledge Each AA in the DRP Trust Network
- Agree/update points of contact at CB for AA (and at AA for CB)
- CB can rely on a Level of Assurance provided by AA for each Consumer
  - Lift from eKYC ? https://bitbucket.org/openid/ekyc-ida/wiki/identifiers 
  - Official definition of LoA: https://csrc.nist.gov/glossary/term/authenticator_assurance_level#:~:text=Definition(s)%3A,AAL3%20(Very%20high%20confidence). 



